Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4819716738712131756" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909219813200" -> "1759461175090388000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_MIN_QUAL"                 = "10" -> "0"
                # (9 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1433176516277873791" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908546866000" -> "1759461174915952000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8258012609127370920" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909194432000" -> "1759461175015483000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7821482627139697870" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908939124200" -> "1759461175472449000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8357151661007186472" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1759398206439454000" -> "1759461175821095000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63" -> (known after apply)
      ~ code_sha256                 = "WAkwuUJlfltUOrbCd9CzslLq2V2qD68EGwzYGfr8DEY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-10-02T09:46:38.960+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:63" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 13332 -> (known after apply)
      ~ version                     = "63" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 75e6b0d2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:62" -> null
      - code_sha256                 = "Nb3NMTUTLS0LPxSCt3nDcsrYougfqXwF8rIqkVBH1bs=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-25T04:00:45.557+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:62" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> null
      - layer_name                  = "svep_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "svep-backend-layers-20250814060124462100000005" -> null
      - s3_key                      = "builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 37631 -> null
      - version                     = "62" -> null
        # (5 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250814060124462100000005/builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "d066b07c6b89f129ac4008ec5d306bcf" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250814060124462100000005/builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> (known after apply)
      ~ key                           = "builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 764756e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::svep-backend-layers-20250814060124462100000005/builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip" -> null
      - bucket                        = "svep-backend-layers-20250814060124462100000005" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "243b39e96ef2378da814b1404865f30d" -> null
      - force_destroy                 = false -> null
      - id                            = "svep-backend-layers-20250814060124462100000005/builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip" -> null
      - key                           = "builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "166824501322642969" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e437f6b087bb875493f71b4838ac5af47b3298919176b2d23917d460ba05c910.zip" -> "builds/339be18918b8b05a4c2065392ad123ce572ea1dd8a9268fb80281ea17a24156b.zip"
          ~ "timestamp" = "1759398206109246000" -> "1759461175764813000"
        }
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] (deposed object ea7cb020) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5748893100490827858" -> null
      - triggers = {
          - "filename"  = "builds/6cdb7676977a4967aa2ebba76e17926685041b74d002d6f950b67e2d98a7038c.zip"
          - "timestamp" = "1758772647040911000"
        } -> null
    }

Plan: 80 to add, 50 to change, 108 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=admin1234 --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin1234! --output json --query AuthenticationResult.IdToken"
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=guest1234 --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest1234! --output json --query AuthenticationResult.IdToken"
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=0b8fc0ac339f13fda39cc3a108dfcd954b484de4]
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=dbdd7b8af9dd2628ca80285b736e57b979af4302]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=e3a382b451556e48c9613fb495f454f40b182f16]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=77984f3fbc1502312bacaa5a86c4caf065f3ce6c]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 0s [id=7458494684139621470]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 0s [id=5801599603944315538]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 0s [id=7187961894017393230]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 0s [id=1851748848889957887]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 1s [id=1648912058837812054]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' archive
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 1s [id=5018301231770864885]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-lkcdgrty
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-lkcdgrty
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 1s [id=9188477533935141086]
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-1mkmhbgx
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-1mkmhbgx
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip' archive
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/performQuery
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_builder.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_engine.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Created: builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creation complete after 0s [id=6884492504613676896]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=2811511690074857171]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 1s [id=855226733519763061]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 0s [id=2924186667423063578]
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: creating 'builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creation complete after 0s [id=3051388714167721686]
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getInfo
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): Created: builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creation complete after 0s [id=8747888604297080335]
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 0s [id=6047866299097109134]
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: creating 'builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getGenomicVariants
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_biosamples.py
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_individuals.py
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): Created: builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creation complete after 0s [id=5191132496375703098]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=629307229397175193]
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): zip: creating 'builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip' archive
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateReports/requirements.txt
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-hbum6bdp
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-hbum6bdp
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=fae34d0d34efcc5c43a95df21abad0ac32aaf459]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): zip: creating 'builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip' archive
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateCohortVCfs/requirements.txt
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creation complete after 0s [id=897e4681e79d088ab5fc22e32eb2ab7b99301bb9]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-bfq3jasy
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-bfq3jasy
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 1s [id=3681857722865438078]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-nvppo00f
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-nvppo00f
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 1s [id=6095912257798936038]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 1s [id=3513578255971174988]
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creation complete after 0s [id=5ae4ebbe3b0d6da39948248cf925c0a93c9ff266]
module.svep[0].aws_lambda_layer_version.binaries_layer: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (deposed object ad961fe7): Destroying... [id=4980990984380490677]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Destruction complete after 0s
module.cognito.aws_ses_identity_notification_topic.bounce: Destroying... [id=no.reply.gaspi.notifications@gmail.com|Bounce]
module.cognito.aws_ses_identity_notification_topic.delivery: Destroying... [id=no.reply.gaspi.notifications@gmail.com|Delivery]
module.cognito.aws_ses_identity_notification_topic.complaint: Destroying... [id=no.reply.gaspi.notifications@gmail.com|Complaint]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.aws_ses_identity_notification_topic.delivery: Destruction complete after 1s
module.cognito.aws_ses_identity_notification_topic.bounce: Destruction complete after 1s
module.cognito.aws_ses_identity_notification_topic.complaint: Destruction complete after 1s
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: creating 'builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip' archive
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created: builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 0s [id=7057332156842210055]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: creating 'builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created: builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip' archive
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/getResultsURL
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 0s [id=4931233207362843010]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 0s [id=6981432512642043819]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip' archive
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/pluginGnomad
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Created: builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/0550f28381343ceca6d965987b1f701b6b1b16d778649909bd38b5c8e6b8e661.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: constraints.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creation complete after 0s [id=781067699499920308]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: mirna.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/0550f28381343ceca6d965987b1f701b6b1b16d778649909bd38b5c8e6b8e661.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 0s [id=4076183994003449318]
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: creating 'builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip' archive
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/clearTempAndRegions
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Created: builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creation complete after 1s [id=278132056591315324]
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip' archive
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 1s [id=5611446938871316311]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: creating 'builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/createPages
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created: builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 1s [id=8704647768988449218]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Collecting markupsafe==2.0.1 (from -r requirements.txt (line 1))
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec):   Using cached markupsafe-2.0.1-cp312-cp312-linux_x86_64.whl
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Collecting markupsafe==2.0.1 (from -r requirements.txt (line 1))
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec):   Using cached markupsafe-2.0.1-cp312-cp312-linux_x86_64.whl
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip' archive
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/initQuery
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created: builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 1s [id=3768668285390230581]
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created: builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip' archive
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/309/default/svep/lambda/batchSubmit
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 0s [id=1630416831012335822]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: creating 'builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding conten
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.